// სახელი
alert("My name is Erekle");

// გვარი
alert("My surname is Dgvepadze");

// ასაკი
alert("I am 13 years old");

// საყვარელი მანქანა
alert("My favorite car is BMW");

// საყვარელი ფერი
alert("My favorite color is black");









alert(5 + 3); // გამოიტანს 8
alert(10 + 20); // გამოიტანს 30
alert(100 + 50); // გამოიტანს 150
alert(1 + 1); // გამოიტანს 2
alert(7 + 13); // გამოიტანს 20




alert(10 - 3); // გამოიტანს 7
alert(50 - 20); // გამოიტანს 30
alert(100 - 40); // გამოიტანს 60
alert(15 - 5); // გამოიტანს 10
alert(30 - 25); // გამოიტანს 5







alert("JavaScript (JS) არის პროგრამირების ენა, რომელიც გამოიყენება ვებ-გვერდების დინამიური ფუნქციების დასამატებლად.");
alert("JS საშუალებას აძლევს დეველოპერებს შექმნან ინტერაქტიული ვებსაიტები.");
alert("JavaScript შეიძლება გამოიყენოს მომხმარებლის მხრიდან (client-side) ან სერვერის მხრიდან (server-side, Node.js-ის გამოყენებით).");
alert("JavaScript მუშაობს HTML და CSS-თან ერთად, რათა ვებსაიტები იყოს ინტუიციური და ფუნქციური.");
alert("JavaScript-ის გამოყენება შესაძლებელია ვებსაიტების ანიმაციისთვის, ფორმის ვალიდაციისთვის, API-ებთან სამუშაოდ და სხვა მრავალი ფუნქციონალისთვის.");