// ცვლადის შექმნა const-ით
const a = 5;  // 'a' არის რიცხვი 5 და მას უკვე არ შეიძლება შეხედოს

// const ცვლადის შეცვლა შეუძლებელია
// a = 10;  // ამ ხაზზე იქნება შეცდომა, რადგან 'a' არის მუდმივი

// const-ით გამართული ობიექტის მაგალითი
const person = { name: "John", age: 30 };  // ობიექტი person

// ობიექტის შიგთავსი შეიძლება შეიცვალოს
person.age = 31;  // შეიცვალა 'age' მახასიათებელი

console.log(person.age);  // 31

// თუმცა, ობიექტს არ შეიძლება დაემატოს ახალი მახასიათებლები
// person = { name: "Alice", age: 25 };  // შეცდომა, რადგან person არის const

// const-ით გამართული მასივის მაგალითი
const numbers = [1, 2, 3];  // მასივი numbers

// მასივის შიგთავსი შეიძლება შეიცვალოს
numbers.push(4);  // დამატებულია ახალი ელემენტი
console.log(numbers);  // [1, 2, 3, 4]

// თუმცა, მასივის ცვლადი არ შეიძლება შეიცვალოს
// numbers = [5, 6, 7];  // შეცდომა, რადგან numbers არის const
